In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('datasets/sales_data_sample.csv', encoding='unicode_escape')
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [3]:
# Inspecting data types
df.dtypes

ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
ADDRESSLINE2         object
CITY                 object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

In [4]:
# Converting to datetime and fix format
df['ORDERDATE'] = pd.to_datetime(df.ORDERDATE, format='%m/%d/%Y %H:%M')
df['ORDERDATE'] = df.ORDERDATE.dt.strftime('%Y-%m-%d %H:%M')
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2003-02-24 00:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,2003-05-07 00:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,2003-07-01 00:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,2003-08-25 00:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,2003-10-10 00:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [5]:
df['ORDERDATE'] = pd.to_datetime(df.ORDERDATE)
df.tail()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2818,10350,20,100.00,15,2244.40,2004-12-02,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,2005-01-31,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,2005-03-01,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,2005-03-28,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,2005-05-06,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

## Working dimension Time

In [6]:
df_time = df[['ORDERDATE', 'MONTH_ID', 'QTR_ID', 'YEAR_ID']].copy(deep=True)
df_time.head()

   ORDERDATE  MONTH_ID  QTR_ID  YEAR_ID
0 2003-02-24         2       1     2003
1 2003-05-07         5       2     2003
2 2003-07-01         7       3     2003
3 2003-08-25         8       3     2003
4 2003-10-10        10       4     2003

## First step will be getting derivate values

### At this moment the dimension time should have the following fields:
- dateid:: yyyymmdd
- day:: dd
- dayname:: (monday-tuesday- and so on)
- month:: mm
- monthname:: (January-February- and so on)
- is_day_of_week:: True/False
- MonthNumberByYear:: 2023-02
- Weeknumber
- Semester
- Quarter
- Year

In [7]:
# Create dateid
df_time['DATEID'] = df_time.ORDERDATE.dt.strftime('%Y%m%d')
df_time['DAY']    = df_time.ORDERDATE.dt.day
df_time['DAYNAME']    = df_time.ORDERDATE.dt.day_name()
df_time['MONTHNAME']  = df_time.ORDERDATE.dt.month_name()
df_time['WEEKNUMBER']  = df_time.ORDERDATE.dt.isocalendar().week
df_time['IS_WEEKDAY'] = df_time['ORDERDATE'].apply(lambda x: 1 if x.weekday() else 0)
df_time['SEMESTER'] = df_time['MONTH_ID'].apply(lambda x: 1 if x < 7 else 2)
df_time['MONTHNUMBERBYYEAR'] = df_time.ORDERDATE.dt.strftime('%Y-%m')
df_time.rename(columns={"ORDERDATE": "FULLDATE", 'YEAR_ID': 'YEAR', 'QTR_ID': 'QUARTER', 'MONTH_ID': 'MONTH'}, inplace=True)
df_time.head()

,FULLDATE,MONTH,QUARTER,YEAR,DATEID,DAY,DAYNAME,MONTHNAME,WEEKNUMBER,IS_WEEKDAY,SEMESTER,MONTHNUMBERBYYEAR
0,2003-02-24,2,1,2003,20030224,24,Monday,February,9,0,1,2003-02
1,2003-05-07,5,2,2003,20030507,7,Wednesday,May,19,1,1,2003-05
2,2003-07-01,7,3,2003,20030701,1,Tuesday,July,27,1,2,2003-07
3,2003-08-25,8,3,2003,20030825,25,Monday,August,35,0,2,2003-08
4,2003-10-10,10,4,2003,20031010,10,Friday,October,41,1,2,2003-10

In [8]:
# Reorder dataframe
cols = ['DATEID', 'YEAR', 'SEMESTER', 'QUARTER', 'MONTHNAME', 'MONTH', 'MONTHNUMBERBYYEAR', 'WEEKNUMBER', 'DAYNAME', 'DAY', 'IS_WEEKDAY', 'FULLDATE']
df_time = df_time.reindex(columns=cols)
df_time.head()

,DATEID,YEAR,SEMESTER,QUARTER,MONTHNAME,MONTH,MONTHNUMBERBYYEAR,WEEKNUMBER,DAYNAME,DAY,IS_WEEKDAY,FULLDATE
0,20030224,2003,1,1,February,2,2003-02,9,Monday,24,0,2003-02-24
1,20030507,2003,1,2,May,5,2003-05,19,Wednesday,7,1,2003-05-07
2,20030701,2003,2,3,July,7,2003-07,27,Tuesday,1,1,2003-07-01
3,20030825,2003,2,3,August,8,2003-08,35,Monday,25,0,2003-08-25
4,20031010,2003,2,4,October,10,2003-10,41,Friday,10,1,2003-10-10

In [9]:
print(f'Dimension Date shape: {df_time.shape}')

Dimension Date shape: (2823, 12)

In [10]:
df_time.drop_duplicates(keep='first',inplace=True)
print(f'Dimension Date shape after dedup: {df_time.shape}')

Dimension Date shape after dedup: (252, 12)

In [11]:
df_time.sort_values(by=['FULLDATE'], inplace=True)
df_time.to_csv('output_files/dim_date.csv', index=False)

## Working dimension Location/geography

In [12]:
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [13]:
df_geo = df[['CITY', 'STATE', 'COUNTRY', 'TERRITORY']].copy(deep=True)
df_geo.head()

            CITY STATE COUNTRY TERRITORY
0            NYC    NY     USA       NaN
1          Reims   NaN  France      EMEA
2          Paris   NaN  France      EMEA
3       Pasadena    CA     USA       NaN
4  San Francisco    CA     USA       NaN

In [14]:
print(f'Dimension Location shape: {df_geo.shape}')

Dimension Location shape: (2823, 4)

In [15]:
df_geo.drop_duplicates(keep='first',inplace=True)
print(f'Dimension Location shape after dedup: {df_geo.shape}')
df_geo.to_csv('output_files/dim_location.csv', index=False)

Dimension Location shape after dedup: (75, 4)

## Working dimension Products

In [16]:
df_prod = df[['PRODUCTCODE', 'PRODUCTLINE', 'MSRP']].copy(deep=True)
df_prod.head()

  PRODUCTCODE  PRODUCTLINE  MSRP
0    S10_1678  Motorcycles    95
1    S10_1678  Motorcycles    95
2    S10_1678  Motorcycles    95
3    S10_1678  Motorcycles    95
4    S10_1678  Motorcycles    95

In [17]:
print(f'Dimension Product shape: {df_prod.shape}')

Dimension Product shape: (2823, 3)

In [18]:
df_prod.drop_duplicates(keep='first',inplace=True)
df_prod.reset_index(drop=True, inplace=True)
df_prod.index += 1

In [19]:
df_prod.reset_index(inplace=True)

In [20]:
df_prod.head()

   index PRODUCTCODE   PRODUCTLINE  MSRP
0      1    S10_1678   Motorcycles    95
1      2    S10_1949  Classic Cars   214
2      3    S10_2016   Motorcycles   118
3      4    S10_4698   Motorcycles   193
4      5    S10_4757  Classic Cars   136

In [21]:
df_prod.columns = ['PRODUCTID', 'PRODUCTCODE', 'PRODUCTLINE', 'MSRP']
print(f'Dimension Product shape after dedup: {df_prod.shape}')
df_prod.to_csv('output_files/dim_product.csv', index=False)

Dimension Product shape after dedup: (109, 4)

## Working dimension Customer

In [67]:
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [68]:
df_customer = df[['CUSTOMERNAME', 'PHONE', 'CONTACTFIRSTNAME', 'CONTACTLASTNAME', 'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE', 'COUNTRY', 'TERRITORY', ]].copy(deep=True)
df_customer.head()

,CUSTOMERNAME,PHONE,CONTACTFIRSTNAME,CONTACTLASTNAME,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY
0,Land of Toys Inc.,2125557818,Kwai,Yu,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN
1,Reims Collectables,26.47.1555,Paul,Henriot,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA
2,Lyon Souveniers,+33 1 46 62 7555,Daniel,Da Cunha,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA
3,Toys4GrownUps.com,6265557265,Julie,Young,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN
4,Corporate Gift Ideas Co.,6505551386,Julie,Brown,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN

In [69]:
print(f'Dimension Customer shape: {df_customer.shape}')

Dimension Customer shape: (2823, 11)

In [74]:
df_customer.drop_duplicates(keep='first',inplace=True)
df_customer.reset_index(drop=True, inplace=True)
df_customer.index += 1

In [75]:
df_customer.reset_index(inplace=True)
# df_customer['LOCATIONID'] = df_customer['index']

In [76]:
df_customer.columns

Index(['index', 'CUSTOMERNAME', 'PHONE', 'CONTACTFIRSTNAME', 'CONTACTLASTNAME',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY'],
      dtype='object')

In [77]:
df_customer = df_customer[['index', 'CUSTOMERNAME', 'PHONE', 'CONTACTFIRSTNAME', 'CONTACTLASTNAME',
                           'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
                           'COUNTRY', 'TERRITORY']]
df_customer.rename(columns={'index': 'CUSTOMERID'}, inplace=True)
df_customer.head()

,CUSTOMERID,CUSTOMERNAME,PHONE,CONTACTFIRSTNAME,CONTACTLASTNAME,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY
0,1,Land of Toys Inc.,2125557818,Kwai,Yu,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN
1,2,Reims Collectables,26.47.1555,Paul,Henriot,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA
2,3,Lyon Souveniers,+33 1 46 62 7555,Daniel,Da Cunha,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA
3,4,Toys4GrownUps.com,6265557265,Julie,Young,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN
4,5,Corporate Gift Ideas Co.,6505551386,Julie,Brown,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN

In [78]:
df_customer.drop_duplicates(keep='first',inplace=True)
print(f'Dimension Customer shape after dedup: {df_customer.shape}')
df_customer.to_csv('output_files/dim_customer.csv', index=False)

Dimension Customer shape after dedup: (92, 12)

## Work in factorderlines

In [48]:
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2003-02-24,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,2003-05-07,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,2003-07-01,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,2003-10-10,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [49]:
df[df.ORDERNUMBER == 10145]

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
3,10145,45,83.26,6,3746.70,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
57,10145,37,100.00,9,5192.95,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
83,10145,33,100.00,8,5176.38,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
243,10145,49,100.00,5,8339.80,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Large
784,10145,30,85.32,14,2559.60,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Small
807,10145,30,49.67,10,1490.10,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Small
1469,10145,43,95.80,7,4119.40,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
1519,10145,40,87.54,16,3501.60,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
1567,10145,47,83.03,11,3902.41,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
1671,10145,27,60.95,3,1645.65,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Small
2101,10145,33,84.77,15,2797.41,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Small
2176,10145,33,93.90,12,3098.70,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
2200,10145,31,35.80,1,1109.80,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Small
2330,10145,27,100.00,4,3251.34,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
2435,10145,38,81.36,2,3091.68,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
2644,10145,20,100.00,13,2752.60,2003-08-25,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Small

In [59]:
df_factorderlines = df[['ORDERNUMBER', 'ORDERLINENUMBER', 'ORDERDATE', 'CUSTOMERNAME', 'PRODUCTCODE', 'QUANTITYORDERED', 'PRICEEACH', 'SALES','DEALSIZE']].copy(deep=True)
df_factorderlines.reset_index(drop=True, inplace=True)
df_factorderlines.head()

,ORDERNUMBER,ORDERLINENUMBER,ORDERDATE,CUSTOMERNAME,PRODUCTCODE,QUANTITYORDERED,PRICEEACH,SALES,DEALSIZE
0,10107,2,2003-02-24,Land of Toys Inc.,S10_1678,30,95.70,2871.00,Small
1,10121,5,2003-05-07,Reims Collectables,S10_1678,34,81.35,2765.90,Small
2,10134,2,2003-07-01,Lyon Souveniers,S10_1678,41,94.74,3884.34,Medium
3,10145,6,2003-08-25,Toys4GrownUps.com,S10_1678,45,83.26,3746.70,Medium
4,10159,14,2003-10-10,Corporate Gift Ideas Co.,S10_1678,49,100.00,5205.27,Medium

In [60]:
# Add CustomerId
df_merged = df_factorderlines.merge(df_customer[['CUSTOMERNAME', 'CUSTOMERID']], on='CUSTOMERNAME', how='left')
df_merged.head()

,ORDERNUMBER,ORDERLINENUMBER,ORDERDATE,CUSTOMERNAME,PRODUCTCODE,QUANTITYORDERED,PRICEEACH,SALES,DEALSIZE,CUSTOMERID
0,10107,2,2003-02-24,Land of Toys Inc.,S10_1678,30,95.70,2871.00,Small,1
1,10121,5,2003-05-07,Reims Collectables,S10_1678,34,81.35,2765.90,Small,2
2,10134,2,2003-07-01,Lyon Souveniers,S10_1678,41,94.74,3884.34,Medium,3
3,10145,6,2003-08-25,Toys4GrownUps.com,S10_1678,45,83.26,3746.70,Medium,4
4,10159,14,2003-10-10,Corporate Gift Ideas Co.,S10_1678,49,100.00,5205.27,Medium,5

In [61]:
# Add DateID
df_merged = df_merged.merge(df_time[['FULLDATE', 'DATEID']], left_on='ORDERDATE', right_on='FULLDATE', how='left')
df_merged.head()

,ORDERNUMBER,ORDERLINENUMBER,ORDERDATE,CUSTOMERNAME,PRODUCTCODE,QUANTITYORDERED,PRICEEACH,SALES,DEALSIZE,CUSTOMERID,FULLDATE,DATEID
0,10107,2,2003-02-24,Land of Toys Inc.,S10_1678,30,95.70,2871.00,Small,1,2003-02-24,20030224
1,10121,5,2003-05-07,Reims Collectables,S10_1678,34,81.35,2765.90,Small,2,2003-05-07,20030507
2,10134,2,2003-07-01,Lyon Souveniers,S10_1678,41,94.74,3884.34,Medium,3,2003-07-01,20030701
3,10145,6,2003-08-25,Toys4GrownUps.com,S10_1678,45,83.26,3746.70,Medium,4,2003-08-25,20030825
4,10159,14,2003-10-10,Corporate Gift Ideas Co.,S10_1678,49,100.00,5205.27,Medium,5,2003-10-10,20031010

In [62]:
# Add ProductID
df_merged = df_merged.merge(df_prod[['PRODUCTCODE', 'PRODUCTID']], on='PRODUCTCODE', how='left')
df_merged.head()

,ORDERNUMBER,ORDERLINENUMBER,ORDERDATE,CUSTOMERNAME,PRODUCTCODE,QUANTITYORDERED,PRICEEACH,SALES,DEALSIZE,CUSTOMERID,FULLDATE,DATEID,PRODUCTID
0,10107,2,2003-02-24,Land of Toys Inc.,S10_1678,30,95.70,2871.00,Small,1,2003-02-24,20030224,1
1,10121,5,2003-05-07,Reims Collectables,S10_1678,34,81.35,2765.90,Small,2,2003-05-07,20030507,1
2,10134,2,2003-07-01,Lyon Souveniers,S10_1678,41,94.74,3884.34,Medium,3,2003-07-01,20030701,1
3,10145,6,2003-08-25,Toys4GrownUps.com,S10_1678,45,83.26,3746.70,Medium,4,2003-08-25,20030825,1
4,10159,14,2003-10-10,Corporate Gift Ideas Co.,S10_1678,49,100.00,5205.27,Medium,5,2003-10-10,20031010,1

In [63]:
# Drop ORDERDATE, FULLDATE, CUSTOMERNAME, AND PRODUCTCODE
df_merged.drop(columns=['ORDERDATE', 'FULLDATE', 'CUSTOMERNAME', 'PRODUCTCODE'], inplace=True)
df_merged.head()

,ORDERNUMBER,ORDERLINENUMBER,QUANTITYORDERED,PRICEEACH,SALES,DEALSIZE,CUSTOMERID,DATEID,PRODUCTID
0,10107,2,30,95.70,2871.00,Small,1,20030224,1
1,10121,5,34,81.35,2765.90,Small,2,20030507,1
2,10134,2,41,94.74,3884.34,Medium,3,20030701,1
3,10145,6,45,83.26,3746.70,Medium,4,20030825,1
4,10159,14,49,100.00,5205.27,Medium,5,20031010,1

In [64]:
df_merged = df_merged[['PRODUCTID', 'CUSTOMERID', 'DATEID', 'ORDERNUMBER', 'ORDERLINENUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'SALES','DEALSIZE']]
df_merged['TOTAL_ORDERLINE_AMOUNT'] = df_merged.apply(lambda row: round(row['PRICEEACH'] * row['QUANTITYORDERED'],2), axis=1)
df_merged['UNITPRICE'] = df_merged.apply(lambda row: round(row['SALES'] / row['QUANTITYORDERED'],2), axis=1)
df_merged.head()

,PRODUCTID,CUSTOMERID,DATEID,ORDERNUMBER,ORDERLINENUMBER,QUANTITYORDERED,PRICEEACH,SALES,DEALSIZE,TOTAL_ORDERLINE_AMOUNT,UNITPRICE
0,1,1,20030224,10107,2,30,95.70,2871.00,Small,2871.00,95.70
1,1,2,20030507,10121,5,34,81.35,2765.90,Small,2765.90,81.35
2,1,3,20030701,10134,2,41,94.74,3884.34,Medium,3884.34,94.74
3,1,4,20030825,10145,6,45,83.26,3746.70,Medium,3746.70,83.26
4,1,5,20031010,10159,14,49,100.00,5205.27,Medium,4900.00,106.23

In [65]:
df_merged[df_merged['SALES'].round(2) != df_merged['TOTAL_ORDERLINE_AMOUNT'].round(2)].head()

,PRODUCTID,CUSTOMERID,DATEID,ORDERNUMBER,ORDERLINENUMBER,QUANTITYORDERED,PRICEEACH,SALES,DEALSIZE,TOTAL_ORDERLINE_AMOUNT,UNITPRICE
4,1,5,20031010,10159,14,49,100.0,5205.27,Medium,4900.0,106.23
7,1,8,20031118,10188,1,48,100.0,5512.32,Medium,4800.0,114.84
9,1,10,20040115,10211,14,41,100.0,4708.44,Medium,4100.0,114.84
10,1,11,20040220,10223,1,37,100.0,3965.66,Medium,3700.0,107.18
11,1,12,20040405,10237,7,23,100.0,2333.12,Small,2300.0,101.44

In [66]:
df_merged.drop_duplicates(keep='first', inplace=True)
df_merged.to_csv('output_files/factorderlines.csv', index=False)

## Work in factorders

In [ ]:
df_factorders = df[['CUSTOMERNAME', 'ORDERDATE', 'ORDERNUMBER', 'ORDERLINENUMBER', 'STATUS']].copy(deep=True)
df_factorders.head()

In [ ]:
df_join = df_factorders.merge(df_merged[['ORDERNUMBER', 'ORDERLINENUMBER', 'CUSTOMERID', 'DATEID', 'SALEPRICE']], on=['ORDERNUMBER', 'ORDERLINENUMBER'], how='left')
df_join.head()

In [ ]:
# Drop columns 'CUSTOMERNAME', AND 'ORDERDATE'
df_join.drop(columns=['CUSTOMERNAME', 'ORDERDATE'], inplace=True)
df_join.head()

In [ ]:
factorders = df_join.groupby(['ORDERNUMBER', 'DATEID', 'CUSTOMERID', 'STATUS'])[['SALEPRICE']].sum()

In [ ]:
factorders.head()

In [ ]:
factorders.reset_index(inplace=True)
factorders = factorders[['CUSTOMERID', 'DATEID','ORDERNUMBER', 'STATUS', 'SALEPRICE']]

In [ ]:
factorders.rename(columns={'SALEPRICE': 'TOTAL_ORDER_AMOUNT'}, inplace=True)
factorders.head()

In [ ]:
factorders.to_csv('output_files/factorders.csv', index=False)

In [1]:
print("hello world")

hello world